tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_IERB.h
#define NETC_IERB_L4CAPR_LINK_TYPE_MASK          (0x10U)
#define NETC_IERB_L4CAPR_LINK_TYPE_SHIFT         (4U)
#define NETC_IERB_L4CAPR_LINK_TYPE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_LINK_TYPE_SHIFT)) & NETC_IERB_L4CAPR_LINK_TYPE_MASK)

#define NETC_IERB_L4CAPR_NUM_TC_MASK             (0xF000U)
#define NETC_IERB_L4CAPR_NUM_TC_SHIFT            (12U)
#define NETC_IERB_L4CAPR_NUM_TC(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_NUM_TC_SHIFT)) & NETC_IERB_L4CAPR_NUM_TC_MASK)

#define NETC_IERB_L4CAPR_NUM_Q_MASK              (0xF0000U)
#define NETC_IERB_L4CAPR_NUM_Q_SHIFT             (16U)
/*! NUM_Q - Number of Egress Traffic Management (ETM) class queues supported */
#define NETC_IERB_L4CAPR_NUM_Q(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_NUM_Q_SHIFT)) & NETC_IERB_L4CAPR_NUM_Q_MASK)

#define NETC_IERB_L4CAPR_NUM_CG_MASK             (0xF000000U)
#define NETC_IERB_L4CAPR_NUM_CG_SHIFT            (24U)
/*! NUM_CG - Number of congestion groups supported */
#define NETC_IERB_L4CAPR_NUM_CG(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_NUM_CG_SHIFT)) & NETC_IERB_L4CAPR_NUM_CG_MASK)

#define NETC_IERB_L4CAPR_TGS_MASK                (0x10000000U)
#define NETC_IERB_L4CAPR_TGS_SHIFT               (28U)
/*! TGS - Time Gate Scheduling */
#define NETC_IERB_L4CAPR_TGS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_TGS_SHIFT)) & NETC_IERB_L4CAPR_TGS_MASK)

#define NETC_IERB_L4CAPR_CBS_MASK                (0x20000000U)
#define NETC_IERB_L4CAPR_CBS_SHIFT               (29U)
/*! CBS - Credit Based Shaping */
#define NETC_IERB_L4CAPR_CBS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4CAPR_CBS_SHIFT)) & NETC_IERB_L4CAPR_CBS_MASK)
/*! @} */

/*! @name L4MCAPR - Link 4 MAC capability register */
/*! @{ */

#define NETC_IERB_L4MCAPR_MAC_VAR_MASK           (0x7U)
#define NETC_IERB_L4MCAPR_MAC_VAR_SHIFT          (0U)
/*! MAC_VAR - MAC Variant */
#define NETC_IERB_L4MCAPR_MAC_VAR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_MAC_VAR_SHIFT)) & NETC_IERB_L4MCAPR_MAC_VAR_MASK)

#define NETC_IERB_L4MCAPR_EFPAD_MASK             (0x30U)
#define NETC_IERB_L4MCAPR_EFPAD_SHIFT            (4U)
/*! EFPAD - Egress frame padding capability */
#define NETC_IERB_L4MCAPR_EFPAD(x)               (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_EFPAD_SHIFT)) & NETC_IERB_L4MCAPR_EFPAD_MASK)

#define NETC_IERB_L4MCAPR_PIPG_MASK              (0x40U)
#define NETC_IERB_L4MCAPR_PIPG_SHIFT             (6U)
/*! PIPG - Configurable preamble/IPG capability */
#define NETC_IERB_L4MCAPR_PIPG(x)                (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_PIPG_SHIFT)) & NETC_IERB_L4MCAPR_PIPG_MASK)

#define NETC_IERB_L4MCAPR_HD_MASK                (0x100U)
#define NETC_IERB_L4MCAPR_HD_SHIFT               (8U)
/*! HD - Half Duplex capability */
#define NETC_IERB_L4MCAPR_HD(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_HD_SHIFT)) & NETC_IERB_L4MCAPR_HD_MASK)

#define NETC_IERB_L4MCAPR_FP_MASK                (0x600U)
#define NETC_IERB_L4MCAPR_FP_SHIFT               (9U)
/*! FP - Indicates if frame preemption is supported */
#define NETC_IERB_L4MCAPR_FP(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_FP_SHIFT)) & NETC_IERB_L4MCAPR_FP_MASK)

#define NETC_IERB_L4MCAPR_MIN_MPDU_MASK          (0x1000U)
#define NETC_IERB_L4MCAPR_MIN_MPDU_SHIFT         (12U)
/*! MIN_MPDU - Minimum MAC Protocol Data Unit (PDU) size check */
#define NETC_IERB_L4MCAPR_MIN_MPDU(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_MIN_MPDU_SHIFT)) & NETC_IERB_L4MCAPR_MIN_MPDU_MASK)

#define NETC_IERB_L4MCAPR_MII_PROT_MASK          (0xF000000U)
#define NETC_IERB_L4MCAPR_MII_PROT_SHIFT         (24U)
/*! MII_PROT - Indicates the MII protocol supported */
#define NETC_IERB_L4MCAPR_MII_PROT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4MCAPR_MII_PROT_SHIFT)) & NETC_IERB_L4MCAPR_MII_PROT_MASK)
/*! @} */

/*! @name L4IOCAPR - Link 4 I/O capability register */
/*! @{ */

#define NETC_IERB_L4IOCAPR_PCS_PROT_MASK         (0xFFFFU)
#define NETC_IERB_L4IOCAPR_PCS_PROT_SHIFT        (0U)
/*! PCS_PROT - PCS protocols supported */
#define NETC_IERB_L4IOCAPR_PCS_PROT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4IOCAPR_PCS_PROT_SHIFT)) & NETC_IERB_L4IOCAPR_PCS_PROT_MASK)

#define NETC_IERB_L4IOCAPR_IO_VAR_MASK           (0xF000000U)
#define NETC_IERB_L4IOCAPR_IO_VAR_SHIFT          (24U)
/*! IO_VAR - IO Variants supported */
#define NETC_IERB_L4IOCAPR_IO_VAR(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4IOCAPR_IO_VAR_SHIFT)) & NETC_IERB_L4IOCAPR_IO_VAR_MASK)

#define NETC_IERB_L4IOCAPR_EMDIO_MASK            (0x10000000U)
#define NETC_IERB_L4IOCAPR_EMDIO_SHIFT           (28U)
/*! EMDIO - External MDIO supported. */
#define NETC_IERB_L4IOCAPR_EMDIO(x)              (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4IOCAPR_EMDIO_SHIFT)) & NETC_IERB_L4IOCAPR_EMDIO_MASK)

#define NETC_IERB_L4IOCAPR_REVMII_RATE_MASK      (0x40000000U)
#define NETC_IERB_L4IOCAPR_REVMII_RATE_SHIFT     (30U)
/*! REVMII_RATE - RevMII MII rate */
#define NETC_IERB_L4IOCAPR_REVMII_RATE(x)        (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4IOCAPR_REVMII_RATE_SHIFT)) & NETC_IERB_L4IOCAPR_REVMII_RATE_MASK)

#define NETC_IERB_L4IOCAPR_REVMII_MASK           (0x80000000U)
#define NETC_IERB_L4IOCAPR_REVMII_SHIFT          (31U)
/*! REVMII - Reverse Mode Device Configuration */
#define NETC_IERB_L4IOCAPR_REVMII(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4IOCAPR_REVMII_SHIFT)) & NETC_IERB_L4IOCAPR_REVMII_MASK)
/*! @} */

/*! @name L4BCR - Link 4 binding configuration register */
/*! @{ */

#define NETC_IERB_L4BCR_SW_PORT_ENETC_INST_MASK  (0x1FU)
#define NETC_IERB_L4BCR_SW_PORT_ENETC_INST_SHIFT (0U)
#define NETC_IERB_L4BCR_SW_PORT_ENETC_INST(x)    (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4BCR_SW_PORT_ENETC_INST_SHIFT)) & NETC_IERB_L4BCR_SW_PORT_ENETC_INST_MASK)

#define NETC_IERB_L4BCR_NETC_FUNC_MASK           (0x40U)
#define NETC_IERB_L4BCR_NETC_FUNC_SHIFT          (6U)
#define NETC_IERB_L4BCR_NETC_FUNC(x)             (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4BCR_NETC_FUNC_SHIFT)) & NETC_IERB_L4BCR_NETC_FUNC_MASK)

#define NETC_IERB_L4BCR_MDIO_PHYAD_PRTAD_MASK    (0x1F00U)
#define NETC_IERB_L4BCR_MDIO_PHYAD_PRTAD_SHIFT   (8U)
#define NETC_IERB_L4BCR_MDIO_PHYAD_PRTAD(x)      (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4BCR_MDIO_PHYAD_PRTAD_SHIFT)) & NETC_IERB_L4BCR_MDIO_PHYAD_PRTAD_MASK)

#define NETC_IERB_L4BCR_SPL_SW_PORT_MASK         (0x1F0000U)
#define NETC_IERB_L4BCR_SPL_SW_PORT_SHIFT        (16U)
#define NETC_IERB_L4BCR_SPL_SW_PORT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_IERB_L4BCR_SPL_SW_PORT_SHIFT)) & NETC_IERB_L4BCR_SPL_SW_PORT_MASK)
/*! @} */

